In [2]:
import pandas as pd
import numpy as np

In [3]:
df = pd.read_csv('data/train.csv')

In [4]:
df.head(2)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C

In [5]:
df.tail(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [6]:
friend_dict_list = [
    {'name':'John','age':25,'job':'student'},
    {'name':'Nate','age':30,'job':'teacher'}
]

In [7]:
df_1 = pd.DataFrame(friend_dict_list)
df_1.head()

   name  age      job
0  John   25  student
1  Nate   30  teacher

In [8]:
df_1=df_1[['name','age','job']]
df_1.head()
# 위에선 제대로 나왔지만, name,age,jog 순서로 출력되는게 보장되진 않기에, 수정해주는 방법임.

   name  age      job
0  John   25  student
1  Nate   30  teacher

In [9]:
from collections import OrderedDict

In [10]:
freind_ordered_dict = OrderedDict(
    [
        ('name',['John','Nate']),
        ('age',[25,30]),
        ('job',['student','teacher'])
    ]
)

In [11]:
df_2 = pd.DataFrame.from_dict(freind_ordered_dict)
df_2.head()
# 위의 그냥 DataFrame에서 추가해서 정확하게 column까지 지정해서 생성하고싶다면
# OrderedDict를 사용해주면 됨.

   name  age      job
0  John   25  student
1  Nate   30  teacher

In [12]:
frend_list =[
    ['john',20,'student'],
    ['nate',30,'teacher']
]
column_name = ['name','age','job']

In [13]:
df_3 = pd.DataFrame.from_records(frend_list,columns=column_name)
df_3.head

<bound method NDFrame.head of    name  age      job
0  john   20  student
1  nate   30  teacher>

In [14]:
friends = [
    {'Name':'Jone','Age':20,'Job':'Student'},
    {'Name':'Jenny','Age':30,'Job':None},
    {'Name':'Nate','Age':30,'Job':'Teacher'}
]

In [15]:
df_4 = pd.DataFrame(friends)
df_4=df_4[['Name','Age','Job']]
df_4.head()

    Name  Age      Job
0   Jone   20  Student
1  Jenny   30     None
2   Nate   30  Teacher

In [16]:
df_4.to_csv('friends.csv')
df_4.to_csv('friends_WithoutNone.csv',index=True,header=True,na_rep='-')
# df_4.to_csv('friends.csv',index=True,header=True) 로 기본값 설정돼있음.
df_4.to_csv('friends_NoneIndex.csv',index=False,header=True)
df_4.to_csv('friends_NoneHeaderNIndex.csv',index=False,header=False)

In [17]:
# 사용법 확인 #1


friend_list = OrderedDict(
    [
        ('name',['John','Jenny','Nate']),
        ('age',[25,30,30]),
        ('job',['student','developer','teacher'])
    ]
)
df= pd.DataFrame.from_dict(friend_list)
df

    name  age        job
0   John   25    student
1  Jenny   30  developer
2   Nate   30    teacher

In [18]:
df[1:3]

    name  age        job
1  Jenny   30  developer
2   Nate   30    teacher

In [19]:
df= df[1:3]
df

    name  age        job
1  Jenny   30  developer
2   Nate   30    teacher

In [20]:
# 사용법 확인 #2

friend_list = OrderedDict(
    [
        ('name',['John','Jenny','Nate']),
        ('age',[25,30,30]),
        ('job',['student','developer','teacher'])
    ]
)
df= pd.DataFrame.from_dict(friend_list)
df

    name  age        job
0   John   25    student
1  Jenny   30  developer
2   Nate   30    teacher

In [21]:
df.loc[[0,2]]
#  loc 은 row(index) 값을 input 하여 그 내용을 Output 으로 가져옴

   name  age      job
0  John   25  student
2  Nate   30  teacher

In [22]:
# 사용법 확인 #3 ----by column condition

friend_list = OrderedDict(
    [
        ('name',['John','Jenny','Nate']),
        ('age',[25,30,30]),
        ('job',['student','developer','teacher'])
    ]
)
df= pd.DataFrame.from_dict(friend_list)
df

    name  age        job
0   John   25    student
1  Jenny   30  developer
2   Nate   30    teacher

In [23]:
df[df.age>25]

    name  age        job
1  Jenny   30  developer
2   Nate   30    teacher

In [24]:
df.query('age>25')

    name  age        job
1  Jenny   30  developer
2   Nate   30    teacher

In [25]:
df[(df.age>25)&(df.name == 'Nate')]

   name  age      job
2  Nate   30  teacher

In [26]:
# 사용법 확인 #4 ---Filter column By index

friend_list =[
    ['John',20,'student'],
    ['Jenny',30,'developer'],
    ['Nate',30,'teacher']
]
column_name = ['name','age','job']
df= pd.DataFrame.from_records(friend_list)
df

       0   1          2
0   John  20    student
1  Jenny  30  developer
2   Nate  30    teacher

In [27]:
df.iloc[:,0:2] #row 는 전부다, column은 0에서 1까지/

       0   1
0   John  20
1  Jenny  30
2   Nate  30

In [28]:
#  DATA FILTERING
df = pd.read_csv('data/train.csv')
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [29]:
df_filtered = df[['Survived','Age']]
df_filtered

     Survived   Age
0           0  22.0
1           1  38.0
2           1  26.0
3           1  35.0
4           0  35.0
..        ...   ...
886         0  27.0
887         1  19.0
888         0   NaN
889         1  26.0
890         0  32.0

[891 rows x 2 columns]

In [30]:
df.filter(items=['Survived','Age'])

     Survived   Age
0           0  22.0
1           1  38.0
2           1  26.0
3           1  35.0
4           0  35.0
..        ...   ...
886         0  27.0
887         1  19.0
888         0   NaN
889         1  26.0
890         0  32.0

[891 rows x 2 columns]

In [31]:
df.filter(like='e',axis=1) #축 1에 있는(axis=1) e가 들어간 모든 정보를 filter(like='e')

,PassengerId,Survived,Name,Sex,Age,Ticket,Fare,Embarked
0,1,0,"Braund, Mr. Owen Harris",male,22.0,A/5 21171,7.2500,S
1,2,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,PC 17599,71.2833,C
2,3,1,"Heikkinen, Miss. Laina",female,26.0,STON/O2. 3101282,7.9250,S
3,4,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,113803,53.1000,S
4,5,0,"Allen, Mr. William Henry",male,35.0,373450,8.0500,S
...,...,...,...,...,...,...,...,...
886,887,0,"Montvila, Rev. Juozas",male,27.0,211536,13.0000,S
887,888,1,"Graham, Miss. Margaret Edith",female,19.0,112053,30.0000,S
888,889,0,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,W./C. 6607,23.4500,S
889,890,1,"Behr, Mr. Karl Howell",male,26.0,111369,30.0000,C
890,891,0,"Dooley, Mr. Patrick",male,32.0,370376,7.7500,Q

In [32]:
df.filter(regex='d$',axis=1) #정규식을 사용해서 d로 끝나는것만 필터링 하고싶어(regex='d$') 1번째 축에서(axis=1)

     PassengerId  Survived Embarked
0              1         0        S
1              2         1        C
2              3         1        S
3              4         1        S
4              5         0        S
..           ...       ...      ...
886          887         0        S
887          888         1        S
888          889         0        S
889          890         1        C
890          891         0        Q

[891 rows x 3 columns]

In [33]:
# 사용법 확인 #5 ---Delete Datas // Drop row&column

friends = [
    {'age':15,'job':'student'},
    {'age':25,'job':'developer'},
    {'age':30,'job':'teacher'}
    ]

df = pd.DataFrame(friends,index=['John','Jenny','Nate'], columns=['age','job'])
df

       age        job
John    15    student
Jenny   25  developer
Nate    30    teacher

In [34]:
df = df.drop(['John','Nate'])
df

       age        job
Jenny   25  developer

In [35]:
friends = [
    {'age':15,'job':'student'},
    {'age':25,'job':'developer'},
    {'age':30,'job':'teacher'}
    ]

df = pd.DataFrame(friends,index=['John','Jenny','Nate'], columns=['age','job'])
df

       age        job
John    15    student
Jenny   25  developer
Nate    30    teacher

In [36]:
df.drop(['John','Nate'],inplace=True) ##이름을 지정해서 삭제 (inplace 는 df = df.### 필요없이 바로 교체하는 팡션)
df

       age        job
Jenny   25  developer

In [37]:
friends = [
    {'Name':'John','age':15,'job':'student'},
    {'Name':'Ben','age':25,'job':'developer'},
    {'Name':'Jenny','age':30,'job':'teacher'}
    ]

df = pd.DataFrame(friends, columns=['Name','age','job'])
df

    Name  age        job
0   John   15    student
1    Ben   25  developer
2  Jenny   30    teacher

In [38]:
df = df.drop(df.index[[0,2]])  ##index 번호를 주고 row 삭제
df

  Name  age        job
1  Ben   25  developer

In [39]:
df = pd.DataFrame(friends, columns=['Name','age','job'])
df

    Name  age        job
0   John   15    student
1    Ben   25  developer
2  Jenny   30    teacher

In [40]:
df = df[df.age>20] #age 값이 20이상인 row 만 삭제!
df

    Name  age        job
1    Ben   25  developer
2  Jenny   30    teacher

In [41]:
df = pd.DataFrame(friends, columns=['Name','age','job'])
df

    Name  age        job
0   John   15    student
1    Ben   25  developer
2  Jenny   30    teacher

In [42]:
df = df.drop('age',axis=1)
df

    Name        job
0   John    student
1    Ben  developer
2  Jenny    teacher

In [43]:
friends = [
    {'Name':'John','age':15,'job':'student'},
    {'Name':'Ben','age':30,'job':'developer'},
    {'Name':'Jenny','age':30,'job':'teacher'}
    ]

df = pd.DataFrame(friends, columns=['Name','age','job'])
df

    Name  age        job
0   John   15    student
1    Ben   30  developer
2  Jenny   30    teacher

In [44]:
df['salary']=0
df

    Name  age        job  salary
0   John   15    student       0
1    Ben   30  developer       0
2  Jenny   30    teacher       0

In [45]:
df['salary'] = np.where(df['job'] !='student','yes','no')
# df[salary] 를 수정할거야. np 를 통해서, where? df[job]값이 student가 아니라면 yes 맞다면 no 입력해줘!
df

    Name  age        job salary
0   John   15    student     no
1    Ben   30  developer    yes
2  Jenny   30    teacher    yes

In [57]:
friends = [
    {'Name':'John','midterm':95,'final':85},
    {'Name':'Ben','midterm':85,'final':80},
    {'Name':'Jenny','midterm':30,'final':10}
    ]

df = pd.DataFrame(friends, columns=['Name','midterm','final'])
df

    Name  midterm  final
0   John       95     85
1    Ben       85     80
2  Jenny       30     10

In [58]:
df['total'] = df['midterm'] + df['final'] # total 이라는 열을 추가서 만들고싶고 그 값은 다음과 같다.
df

    Name  midterm  final  total
0   John       95     85    180
1    Ben       85     80    165
2  Jenny       30     10     40

In [59]:
df['average'] =df['total']/2
df

    Name  midterm  final  total  average
0   John       95     85    180     90.0
1    Ben       85     80    165     82.5
2  Jenny       30     10     40     20.0

In [60]:
# A,B,C,D,F [ Grade 매기기 ]
grade =[]
for row in df['average']:
    if row >= 90:
        grade.append('A')
    elif row >= 80:
        grade.append('B')
    else:
        grade.append('F')
df['grade'] = grade
df

    Name  midterm  final  total  average grade
0   John       95     85    180     90.0     A
1    Ben       85     80    165     82.5     B
2  Jenny       30     10     40     20.0     F

In [63]:
def pass_or_fail(row):
    if row !='F':
        return 'PASS'
    else:
        return 'Fail'

df.grade = df.grade.apply(pass_or_fail) #grade값을 grade에 pof 함수를 apply 시킨값을 넣는다.
df

    Name  midterm  final  total  average grade
0   John       95     85    180     90.0  PASS
1    Ben       85     80    165     82.5  PASS
2  Jenny       30     10     40     20.0  PASS

In [67]:
date_list = [
    {
        'yyyy-mm-dd' : '2000-06-27'
    },
    {
        'yyyy-mm-dd' : '2007-10-14'
    }
]

df = pd.DataFrame(date_list,columns=['yyyy-mm-dd'])
df

   yyyy-mm-dd
0  2000-06-27
1  2007-10-14

In [69]:
# 위의 값 2000-06-27  에서 2000만 뽑아내고 싶다면 어떻게 해야하나??
def extract_year(row):
    return row.split('-')[0] # - 로 나뉘어진 값들 중에서 0번째 값만 가져오고싶다

df['year'] = df['yyyy-mm-dd'].apply(extract_year)
df

   yyyy-mm-dd  year
0  2000-06-27  2000
1  2007-10-14  2007

In [73]:
friends = [
    {'Name':'John','midterm':95,'final':85},
    {'Name':'Ben','midterm':85,'final':80},
    {'Name':'Jenny','midterm':30,'final':10}
    ]

df = pd.DataFrame(friends, columns=['Name','midterm','final'])
df

    Name  midterm  final
0   John       95     85
1    Ben       85     80
2  Jenny       30     10

In [74]:
df2 = pd.DataFrame([
    ['Ben',50,50]
], columns= ['Name','midterm','final'])
df2

  Name  midterm  final
0  Ben       50     50

In [76]:
# df 에다가 df2 값을 추가하고싶어!
df.append(df2,ignore_index=True) #인덱스값을 무시하고 넣어라

    Name  midterm  final
0   John       95     85
1    Ben       85     80
2  Jenny       30     10
3    Ben       50     50

In [79]:
student_list = [{'name': 'John', 'major': "Computer Science", 'sex': "male"},
                {'name': 'Nate', 'major': "Computer Science", 'sex': "male"},
                {'name': 'Abraham', 'major': "Physics", 'sex': "male"},
                {'name': 'Brian', 'major': "Psychology", 'sex': "male"},
                {'name': 'Janny', 'major': "Economics", 'sex': "female"},
                {'name': 'Yuna', 'major': "Economics", 'sex': "female"},
                {'name': 'Jeniffer', 'major': "Computer Science", 'sex': "female"},
                {'name': 'Edward', 'major': "Computer Science", 'sex': "male"},
                {'name': 'Zara', 'major': "Psychology", 'sex': "female"},
                {'name': 'Wendy', 'major': "Economics", 'sex': "female"},
                {'name': 'Sera', 'major': "Psychology", 'sex': "female"}
         ]
df = pd.DataFrame(student_list, columns = ['name', 'major', 'sex'])
df

        name             major     sex
0       John  Computer Science    male
1       Nate  Computer Science    male
2    Abraham           Physics    male
3      Brian        Psychology    male
4      Janny         Economics  female
5       Yuna         Economics  female
6   Jeniffer  Computer Science  female
7     Edward  Computer Science    male
8       Zara        Psychology  female
9      Wendy         Economics  female
10      Sera        Psychology  female

In [85]:
groupby_major = df.groupby('major') # groupby 를 사용해서 df 내에 있는 major 의 동일값을 그룹화 했음.
groupby_major.groups

{'Computer Science': [0, 1, 6, 7], 'Economics': [4, 5, 9], 'Physics': [2], 'Psychology': [3, 8, 10]}

In [87]:
for name, group in groupby_major:  #나은 시각화를 위해 g_m 내에서 name 과 group 을 가져온다
    print(name + ' : ' + str(len(group)))
    print(group)
    print()

Computer Science : 4
       name             major     sex
0      John  Computer Science    male
1      Nate  Computer Science    male
6  Jeniffer  Computer Science  female
7    Edward  Computer Science    male

Economics : 3
    name      major     sex
4  Janny  Economics  female
5   Yuna  Economics  female
9  Wendy  Economics  female

Physics : 1
      name    major   sex
2  Abraham  Physics  male

Psychology : 3
     name       major     sex
3   Brian  Psychology    male
8    Zara  Psychology  female
10   Sera  Psychology  female

In [90]:
# 학과별로 몇명이 있는지 데이터프레임으로 만들고싶어!
df_major_cnt = pd.DataFrame( {'count' : groupby_major.size()}).reset_index()
df_major_cnt

              major  count
0  Computer Science      4
1         Economics      3
2           Physics      1
3        Psychology      3

In [94]:
groupby_sex = df.groupby('sex')
for name, group in groupby_sex:  #성별로 나누어보기
    print(name + ' : ' + str(len(group)))
    print(group)
    print()

female : 6
        name             major     sex
4      Janny         Economics  female
5       Yuna         Economics  female
6   Jeniffer  Computer Science  female
8       Zara        Psychology  female
9      Wendy         Economics  female
10      Sera        Psychology  female

male : 5
      name             major   sex
0     John  Computer Science  male
1     Nate  Computer Science  male
2  Abraham           Physics  male
3    Brian        Psychology  male
7   Edward  Computer Science  male

In [96]:
student_list = [{'name': 'John', 'major': "Computer Science", 'sex': "male"},
                {'name': 'Nate', 'major': "Computer Science", 'sex': "male"},
                {'name': 'Abraham', 'major': "Physics", 'sex': "male"},
                {'name': 'Brian', 'major': "Psychology", 'sex': "male"},
                {'name': 'Janny', 'major': "Economics", 'sex': "female"},
                {'name': 'Yuna', 'major': "Economics", 'sex': "female"},
                {'name': 'Jeniffer', 'major': "Computer Science", 'sex': "female"},
                {'name': 'Edward', 'major': "Computer Science", 'sex': "male"},
                {'name': 'Zara', 'major': "Psychology", 'sex': "female"},
                {'name': 'Wendy', 'major': "Economics", 'sex': "female"},
                {'name': 'Sera', 'major': "Psychology", 'sex': "female"},
                {'name': 'John', 'major': "Computer Science", 'sex': "male"},
         ]
df = pd.DataFrame(student_list, columns = ['name', 'major', 'sex'])
df

        name             major     sex
0       John  Computer Science    male
1       Nate  Computer Science    male
2    Abraham           Physics    male
3      Brian        Psychology    male
4      Janny         Economics  female
5       Yuna         Economics  female
6   Jeniffer  Computer Science  female
7     Edward  Computer Science    male
8       Zara        Psychology  female
9      Wendy         Economics  female
10      Sera        Psychology  female
11      John  Computer Science    male

In [104]:
df.drop_duplicates()

        name             major     sex
0       John  Computer Science    male
1       Nate  Computer Science    male
2    Abraham           Physics    male
3      Brian        Psychology    male
4      Janny         Economics  female
5       Yuna         Economics  female
6   Jeniffer  Computer Science  female
7     Edward  Computer Science    male
8       Zara        Psychology  female
9      Wendy         Economics  female
10      Sera        Psychology  female

In [107]:
student_list = [{'name': 'John', 'major': "Computer Science", 'sex': "male"},
                {'name': 'Nate', 'major': "Computer Science", 'sex': "male"},
                {'name': 'Abraham', 'major': "Physics", 'sex': "male"},
                {'name': 'Brian', 'major': "Psychology", 'sex': "male"},
                {'name': 'Janny', 'major': "Economics", 'sex': "female"},
                {'name': 'Yuna', 'major': "Economics", 'sex': "female"},
                {'name': 'Jeniffer', 'major': "Computer Science", 'sex': "female"},
                {'name': 'Edward', 'major': "Computer Science", 'sex': "male"},
                {'name': 'Zara', 'major': "Psychology", 'sex': "female"},
                {'name': 'Wendy', 'major': "Economics", 'sex': "female"},
                {'name': 'Nate', 'major': None, 'sex': "male"},
                {'name': 'John', 'major': "Computer Science", 'sex': None},
         ]
df = pd.DataFrame(student_list, columns = ['name', 'major', 'sex'])
df

        name             major     sex
0       John  Computer Science    male
1       Nate  Computer Science    male
2    Abraham           Physics    male
3      Brian        Psychology    male
4      Janny         Economics  female
5       Yuna         Economics  female
6   Jeniffer  Computer Science  female
7     Edward  Computer Science    male
8       Zara        Psychology  female
9      Wendy         Economics  female
10      Nate              None    male
11      John  Computer Science    None

In [113]:
df.duplicated(['name']) #duplicated() 는 완전히 같은것만 찾아줌. 따라서 () 안에 인자 [''] 를 넣어주면 지정할 수 있음.

0     False
1     False
2     False
3     False
4     False
5     False
6     False
7     False
8     False
9     False
10     True
11     True
dtype: bool

In [117]:
df.drop_duplicates(['name'], keep='last') ## keep 을 넣어줌으로써 먼저 나오는값을 지울지 나중값을 지울 지 선택가능

        name             major     sex
2    Abraham           Physics    male
3      Brian        Psychology    male
4      Janny         Economics  female
5       Yuna         Economics  female
6   Jeniffer  Computer Science  female
7     Edward  Computer Science    male
8       Zara        Psychology  female
9      Wendy         Economics  female
10      Nate              None    male
11      John  Computer Science    None

In [119]:
#NAN 값을 찾고 원하는 값으로 변경하기.
school_id_list = [{'name': 'John', 'job': "teacher", 'age': 40},
                {'name': 'Nate', 'job': "teacher", 'age': 35},
                {'name': 'Yuna', 'job': "teacher", 'age': 37},
                {'name': 'Abraham', 'job': "student", 'age': 10},
                {'name': 'Brian', 'job': "student", 'age': 12},
                {'name': 'Janny', 'job': "student", 'age': 11},
                {'name': 'Nate', 'job': "teacher", 'age': None},
                {'name': 'John', 'job': "student", 'age': None}
         ]
df = pd.DataFrame(school_id_list, columns = ['name', 'job', 'age'])
df

      name      job   age
0     John  teacher  40.0
1     Nate  teacher  35.0
2     Yuna  teacher  37.0
3  Abraham  student  10.0
4    Brian  student  12.0
5    Janny  student  11.0
6     Nate  teacher   NaN
7     John  student   NaN

In [121]:
df.shape

(8, 3)

In [124]:
df.info() ## name 값과 job 값은 8엔트리 중 8개 모두 non 값이 없지만 age는 6개만 non이 없음.

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    8 non-null      object
 1   job     8 non-null      object
 2   age     6 non-null      float64
dtypes: float64(1), object(2)
memory usage: 320.0+ bytes

In [127]:
df.isna() ## == isnull()

    name    job    age
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False
4  False  False  False
5  False  False  False
6  False  False   True
7  False  False   True

In [129]:
df.age = df.age.fillna(0) # df.age 에다가 df.age 에 있는 na 값을 0 으로 대신 채워넣고 저장한다.
df

      name      job   age
0     John  teacher  40.0
1     Nate  teacher  35.0
2     Yuna  teacher  37.0
3  Abraham  student  10.0
4    Brian  student  12.0
5    Janny  student  11.0
6     Nate  teacher   0.0
7     John  student   0.0

In [133]:
# 보통 non 값이 발생 할 경우 0 으로 대충넣는게 아닌 그럴 듯 한 값으로 넣어줌
# 그 값이 바로 공통된 조건을 가진 사람들의 나이의 평균값!
df = pd.DataFrame(school_id_list, columns = ['name', 'job', 'age'])
df['age'].fillna(df.groupby('job')['age'].transform('median'),inplace=True)  #df의 age 값에 있는 na를 바꾸고싶어(df에서 'job'그룹의 [age 값을가져와서].그중 na 를'중간값'으로)
df

      name      job   age
0     John  teacher  40.0
1     Nate  teacher  35.0
2     Yuna  teacher  37.0
3  Abraham  student  10.0
4    Brian  student  12.0
5    Janny  student  11.0
6     Nate  teacher  37.0
7     John  student  11.0

In [135]:
# apply 함수 다른 예제
date_list = [
    {'yyyy-mm-dd' : '2000-06-27'},
    {'yyyy-mm-dd' : '2002-10-14'},
    {'yyyy-mm-dd' : '2008-04-08'}
]

df = pd.DataFrame(date_list,columns=['yyyy-mm-dd'])

df

   yyyy-mm-dd
0  2000-06-27
1  2002-10-14
2  2008-04-08

In [138]:
def extract_year(column):
    return column.split('-')[0]

df['year'] = df['yyyy-mm-dd'].apply(extract_year) ## df에 year 를 만들건데, 그 값은 df에 있는 yyyy-mm-dd 를 e_y 함수에 넣는다.
df

   yyyy-mm-dd  year
0  2000-06-27  2000
1  2002-10-14  2002
2  2008-04-08  2008

In [140]:
def get_age(year,current_year):
    return current_year - int(year)
df['age'] = df['year'].apply(get_age,current_year = 2021) ## df 에 age 를 만들건데 그값은 year 에 있는 값을 g_a 에 넣고 c_y = 2021이다.
df

   yyyy-mm-dd  year  age
0  2000-06-27  2000   21
1  2002-10-14  2002   19
2  2008-04-08  2008   13

In [143]:
def get_introduce(age,prefix,suffix):
    return prefix + str(age)  + suffix
df['introduce'] = df['age'].apply(get_introduce,prefix='I am ',suffix=' year old')
df

   yyyy-mm-dd  year  age         introduce
0  2000-06-27  2000   21  I am 21 year old
1  2002-10-14  2002   19  I am 19 year old
2  2008-04-08  2008   13  I am 13 year old

In [147]:
def get_introduce_2(row):
    return '///I was born in ' +str(row.year)+'my age is' + str(row.age)

df['introduce_2'] = df.apply(get_introduce_2,axis=1) # axis = 1 : row 에 있는 모든 column 사용
df

   yyyy-mm-dd  year  age         introduce                       introduce_2
0  2000-06-27  2000   21  I am 21 year old  ///I was born in 2000my age is21
1  2002-10-14  2002   19  I am 19 year old  ///I was born in 2002my age is19
2  2008-04-08  2008   13  I am 13 year old  ///I was born in 2008my age is13

In [162]:
# map, applymap 함수 예제
date_list = [
    {'date' : '2000-06-27'},
    {'date' : '2002-10-14'},
    {'date' : '2008-04-08'}
]

df = pd.DataFrame(date_list,columns=['date'])
def extract_year(column):
    return column.split('-')[0]

In [164]:
df['year'] = df['date'].map(extract_year) ## 이 상황에서의 map 함수는 apply 함수와 완전히 똑같음
df

         date  year
0  2000-06-27  2000
1  2002-10-14  2002
2  2008-04-08  2008

In [209]:
############# map 함수의 apply 함수와 다른 사용법
friends = [
    {'age':15,'job':'student'},
    {'age':25,'job':'developer'},
    {'age':30,'job':'teacher'}
    ]

df = pd.DataFrame(friends,index=['John','Jenny','Nate'], columns=['age','job'])
df

       age        job
John    15    student
Jenny   25  developer
Nate    30    teacher

In [210]:
df.job = df.job.map({'student' : 1, 'developer':2,'teacher':3}) ##이렇게 딕셔너리 형식으로 변환도 가능
df

       age  job
John    15    1
Jenny   25    2
Nate    30    3

In [171]:
x_y = [
    {'x':5.5,'y':-5.6,'z':-1.1},
    {'x':-5.2,'y':5.5,'z':-2.2},
    {'x':-1.6,'y':-4.5,'z':-3.3}
]
df = pd.DataFrame(x_y)
df

     x    y    z
0  5.5 -5.6 -1.1
1 -5.2  5.5 -2.2
2 -1.6 -4.5 -3.3

In [173]:
## 한개에만 적용시킬 게 아니라 df 전체에 적용시키고싶어!
df= df.applymap(np.around)
df

     x    y    z
0  6.0 -6.0 -1.0
1 -5.0  6.0 -2.0
2 -2.0 -4.0 -3.0

In [176]:
############## UNIQUE , Value_counts 특수한 값 뽑아내고 갯수 확인하기! ###########


job_list = [{'name': 'John', 'job': "teacher"},
                {'name': 'Nate', 'job': "teacher"},
                {'name': 'Fred', 'job': "teacher"},
                {'name': 'Abraham', 'job': "student"},
                {'name': 'Brian', 'job': "student"},
                {'name': 'Janny', 'job': "developer"},
                {'name': 'Nate', 'job': "teacher"},
                {'name': 'Obrian', 'job': "dentist"},
                {'name': 'Yuna', 'job': "teacher"},
                {'name': 'Rob', 'job': "lawyer"},
                {'name': 'Brian', 'job': "student"},
                {'name': 'Matt', 'job': "student"},
                {'name': 'Wendy', 'job': "banker"},
                {'name': 'Edward', 'job': "teacher"},
                {'name': 'Ian', 'job': "teacher"},
                {'name': 'Chris', 'job': "banker"},
                {'name': 'Philip', 'job': "lawyer"},
                {'name': 'Janny', 'job': "basketball player"},
                {'name': 'Gwen', 'job': "teacher"},
                {'name': 'Jessy', 'job': "student"}
         ]
df = pd.DataFrame(job_list, columns = ['name', 'job'])
df

       name                job
0      John            teacher
1      Nate            teacher
2      Fred            teacher
3   Abraham            student
4     Brian            student
5     Janny          developer
6      Nate            teacher
7    Obrian            dentist
8      Yuna            teacher
9       Rob             lawyer
10    Brian            student
11     Matt            student
12    Wendy             banker
13   Edward            teacher
14      Ian            teacher
15    Chris             banker
16   Philip             lawyer
17    Janny  basketball player
18     Gwen            teacher
19    Jessy            student

In [178]:
df.job.unique() ##  class 에 여러개 값이 있어도 이름은 하나만 출력

array(['teacher', 'student', 'developer', 'dentist', 'lawyer', 'banker',
       'basketball player'], dtype=object)

In [180]:
df.job.value_counts() #각 class 값의 갯수 출력

teacher              8
student              5
banker               2
lawyer               2
dentist              1
developer            1
basketball player    1
Name: job, dtype: int64

In [205]:
############### 두개의 데이터프레임 합치기 ###########

l1 = [{'name': 'John', 'job': "teacher"},
      {'name': 'Nate', 'job': "student"},
      {'name': 'Fred', 'job': "developer"}]

l2 = [{'name': 'Ed', 'job': "dentist"},
      {'name': 'Jack', 'job': "farmer"},
      {'name': 'Ted', 'job': "designer"}]

l3 = [{'name': 'John', 'job': "teacher"},
      {'name': 'Nate', 'job': "student"},
      {'name': 'Nate', 'job': "student"},
      {'name': 'Jack', 'job': "developer"}]

l4 = [{'age': 25, 'country': "U.S"},
      {'age': 30, 'country': "U.K"},
      {'age': 45, 'country': "Korea"}]
         
df1 = pd.DataFrame(l1, columns = ['name', 'job'])
df2 = pd.DataFrame(l2, columns = ['name', 'job'])

In [183]:
df1

   name        job
0  John    teacher
1  Nate    student
2  Fred  developer

In [185]:
df2

   name       job
0    Ed   dentist
1  Jack    farmer
2   Ted  designer

In [189]:
## 두 개 합치기 column name 이 같으니 row 로 합쳐보겠음
result = pd.concat([df1,df2],ignore_index=True) #i_i 가 없으면 index 가 0,1,2,0,1,2 로 겹치게 들어감.
result

   name        job
0  John    teacher
1  Nate    student
2  Fred  developer
3    Ed    dentist
4  Jack     farmer
5   Ted   designer

In [194]:
result = df1.append(df2,ignore_index=True)
result

   name        job
0  John    teacher
1  Nate    student
2  Fred  developer
3    Ed    dentist
4  Jack     farmer
5   Ted   designer

In [206]:
## 두 개 합치기, row data 를 column 으로 합치기

df1 = pd.DataFrame(l3, columns = ['name', 'job'])
df2 = pd.DataFrame(l4, columns = ['age', 'country'])
df1

   name        job
0  John    teacher
1  Nate    student
2  Nate    student
3  Jack  developer

In [200]:
df2

   age country
0   25     U.S
1   30     U.K
2   45   Korea

In [207]:
result = pd.concat([df1,df2],axis=1,ignore_index=True) ##보니까 거의 대부분의 합치는건 row 가 기준임. 따라서 column을 합치려면 axis=1 을 추가하는듯 함
result

      0          1     2      3
0  John    teacher  25.0    U.S
1  Nate    student  30.0    U.K
2  Nate    student  45.0  Korea
3  Jack  developer   NaN    NaN

In [1]:
# 실제값과 예측값 비교
label = [1,2,3,4,5]
prediction = [1,2,2,4,4]
comparison = pd.DataFrame({'label':label,'prediction':prediction})
comparison

NameError: name 'pd' is not defined